# yolov5s_v7_neck_only_se.yaml
# 目标: Backbone 使用 YOLOv5 v7.0 原始结构 (无SEBlock)。
#       SEBlock (r=16) 添加到 Neck 部分的关键C3模块之后，即送入Detect层之前的三个特征图。

# Parameters
nc: 22                # 类别数量 (number of classes)
depth_multiple: 0.33  # 模型深度倍数 (model depth multiple)
width_multiple: 0.50  # 模型宽度/通道倍数 (layer channel multiple)
anchors: # 预设锚框
  - [10, 13, 16, 30, 33, 23]  # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v7.0 Backbone (原始结构，无SEBlock)
# 作用: 从输入图像中提取P3, P4, P5三个尺度的特征图。
backbone:                               # Layer | Output Channels (Actual) | Marker for Neck
  # Stem
  [[-1, 1, Conv, [64, 6, 2, 2]],       # 0     | 32                       | P1_Conv (初始下采样)
  # Stage 1
   [-1, 1, Conv, [128, 3, 2]],      # 1     | 64                       | P2_Conv (二次下采样)
   [-1, 3, C3, [128]],               # 2     | 64                       | P2_C3   (P2尺度特征提取)
  # Stage 2
   [-1, 1, Conv, [256, 3, 2]],      # 3     | 128                      | P3_Conv (三次下采样)
   [-1, 6, C3, [256]],               # 4     | 128                      | P3_out  (P3尺度特征提取, Neck用此层输出)
  # Stage 3
   [-1, 1, Conv, [512, 3, 2]],      # 5     | 256                      | P4_Conv (四次下采样)
   [-1, 9, C3, [512]],               # 6     | 256                      | P4_out  (P4尺度特征提取, Neck用此层输出)
  # Stage 4
   [-1, 1, Conv, [1024, 3, 2]],     # 7     | 512                      | P5_Conv (五次下采样)
   [-1, 3, C3, [1024]],              # 8     | 512                      | P5_C3   (P5尺度特征提取)
  # SPP Layer
   [-1, 1, SPPF, [1024, 5]],       # 9     | 512                      | P5_SPPF (空间金字塔池化, Neck用此层输出)
  ]

# YOLOv5 v7.0 Head (Neck部分加入SEBlock)
# 作用: Neck (FPN+PAN) 融合Backbone输出的P3_out, P4_out, P5_SPPF特征。
#       在Neck的每个主要融合路径的C3模块之后加入SEBlock，增强最终送给Detect层的特征。
head:
  # --- FPN path (自顶向下特征融合) ---
  [[-1, 1, Conv, [512, 1, 1]],           # 10    | From P5_SPPF (L9, 512ch) -> 1x1 Conv  | 256 (P5_neck_in)
   [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 11    | Upsample P5_neck_in                    | 256
   [[-1, 6], 1, Concat, [1]],            # 12    | Concat(upsampled_P5_neck_in, P4_out from L6) | 256+256=512
   [-1, 3, C3, [512, False]],            # 13    | C3 on P4-level fusion                  | 256 (P4_fused)
   # 在 P4_fused (FPN路径处理P4的C3) 之后加入 SEBlock
   [-1, 1, SEBlock, [256, 16]],         # 14    | SEBlock on P4_fused                    | 256 (P4_fused_SE)

   # 继续FPN路径，准备与P3融合
   [-1, 1, Conv, [256, 1, 1]],           # 15    | From P4_fused_SE (L14) -> 1x1 Conv     | 128
   [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 16    | Upsample                               | 128
   [[-1, 4], 1, Concat, [1]],            # 17    | Concat(upsampled, P3_out from L4)       | 128+128=256
   [-1, 3, C3, [256, False]],            # 18    | C3 on P3-level fusion                  | 128 (P3_fused)
   # 在 P3_fused (最终送给Detect的P3路径) 之后加入 SEBlock
   [-1, 1, SEBlock, [128, 16]],         # 19    | SEBlock on P3_fused                    | 128 (P3_detect_in) <- 1st Detect head input

  # --- PAN path (自底向上特征融合) ---
  # 从 P3_fused (L18, 未经SE处理) 开始PAN的下采样路径，以获取更原始的定位信息向上传递
  [18, 1, Conv, [256, 3, 2]],           # 20    | Downsample P3_fused (from L18)         | 128
   # 与Neck中FPN路径上的 P4_fused_SE (L14) 进行拼接
  [[-1, 14], 1, Concat, [1]],           # 21    | Concat(downsampled_P3, P4_fused_SE from L14) | 128+256=384
  [-1, 3, C3, [512, False]],            # 22    | C3 on P4-level PAN fusion              | 256 (P4_aggregated)
  # 在 P4_aggregated (最终送给Detect的P4路径) 之后加入 SEBlock
  [-1, 1, SEBlock, [256, 16]],         # 23    | SEBlock on P4_aggregated               | 256 (P4_detect_in) <- 2nd Detect head input

  # 从 P4_aggregated (L22, 未经SE处理) 开始PAN的下采样路径
  [22, 1, Conv, [512, 3, 2]],           # 24    | Downsample P4_aggregated (from L22)    | 256
   # 与Neck中FPN路径上的 P5_neck_in (L10) 进行拼接
  [[-1, 10], 1, Concat, [1]],           # 25    | Concat(downsampled_P4, P5_neck_in from L10) | 256+256=512
  [-1, 3, C3, [1024, False]],           # 26    | C3 on P5-level PAN fusion              | 512 (P5_aggregated)
  # 在 P5_aggregated (最终送给Detect的P5路径) 之后加入 SEBlock
  [-1, 1, SEBlock, [512, 16]],         # 27    | SEBlock on P5_aggregated               | 512 (P5_detect_in) <- 3rd Detect head input

  # --- Detection Head ---
  # 输入来自Neck中三个经过SEBlock增强的特征图
  [[19, 23, 27], 1, Detect, [nc, anchors]], # 28    | Detect head inputs: P3_detect_in, P4_detect_in, P5_detect_in
]