# yolov5s_se_backbone_and_neck.yaml
# 目标: 在Backbone中保留SEBlock，同时在Neck的关键融合节点后也加入SEBlock
#理论上可以让模型的精度提高，但也有可能造成过拟合
#计算量会更高一些

# Parameters
nc: 22 # 类别数量 (number of classes)
depth_multiple: 0.33  # 模型深度倍数 (model depth multiple)
width_multiple: 0.50  # 模型宽度/通道倍数 (layer channel multiple)
anchors: # 预设锚框，分别对应P3, P4, P5三个检测头
  - [10, 13, 16, 30, 33, 23]  # P3/8 (用于检测小目标)
  - [30, 61, 62, 45, 59, 119] # P4/16 (用于检测中等目标)
  - [116, 90, 156, 198, 373, 326] # P5/32 (用于检测大目标)

# YOLOv5 v6.0 Backbone with SEBlocks
# 作用: 从输入图像中提取多层次的特征图 (P3, P4, P5)。
#       通过卷积层进行下采样和特征变换，通过C3模块进行深度特征提取。
#       SEBlock用于在特定阶段增强重要特征通道。
backbone:                               # 输出层序号 | 模块作用与输出尺寸 | 输出通道数 (被width_multiple缩放后)
  [[-1, 1, Conv, [64, 6, 2, 2]],       # 0        | 初始卷积, P1/2      | 32
   [-1, 1, Conv, [128, 3, 2]],      # 1        | 下采样, P2/4        | 64
   [-1, 3, C3, [128]],               # 2        | P2特征提取         | 64
   [-1, 1, SEBlock, [64, 16]],       # 3        | P2特征通道注意力    | 64 (P2_SE)
   [-1, 1, Conv, [256, 3, 2]],      # 4        | 下采样, P3/8        | 128
   [-1, 6, C3, [256]],               # 5        | P3特征提取         | 128
   [-1, 1, SEBlock, [128, 16]],      # 6        | P3特征通道注意力    | 128 (P3_SE) <- 用于FPN的P3特征来自此层
   [-1, 1, Conv, [512, 3, 2]],      # 7        | 下采样, P4/16       | 256
   [-1, 9, C3, [512]],               # 8        | P4特征提取         | 256
   [-1, 1, SEBlock, [256, 16]],      # 9        | P4特征通道注意力    | 256 (P4_SE) <- 用于FPN的P4特征来自此层
   [-1, 1, Conv, [1024, 3, 2]],     # 10       | 下采样, P5/32       | 512
   [-1, 3, C3, [1024]],              # 11       | P5特征提取         | 512
   [-1, 1, SPPF, [1024, 5]],       # 12       | 空间金字塔池化      | 512 (P5_SPPF) <- 用于FPN的P5特征来自此层
  ]

# YOLOv5 v6.0 Head with additional SEBlocks in Neck
# 作用: Neck部分(FPN+PAN)负责融合Backbone输出的多尺度特征(P3_SE, P4_SE, P5_SPPF)。
#       FPN路径自顶向下传递语义信息，PAN路径自底向上传递定位信息。
#       在Neck的关键C3模块后加入SEBlock，进一步增强融合后特征的表达能力。
#       Head部分(Detect层)基于Neck输出的三个尺度特征图进行最终的目标检测。
head:
  # --- FPN path (自顶向下特征融合) ---
  [[-1, 1, Conv, [512, 1, 1]],           # 13       | 从P5_SPPF(层12)降维 | 256 (P5_neck_in)
   [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 14       | P5_neck_in上采样   | 256 (尺寸同P4)
   [[-1, 9], 1, Concat, [1]],            # 15       | concat(upsampled_P5_neck_in, P4_SE from layer 9) | 256(P5_up) + 256(P4_SE) = 512
   [-1, 3, C3, [512, False]],            # 16       | FPN融合P5和P4后的C3处理 | 256 (P4_fused)
   # 在P4_fused之后加入SEBlock
   [-1, 1, SEBlock, [256, 16]],         # 17       | P4_fused通道注意力  | 256 (P4_fused_SE)

   [-1, 1, Conv, [256, 1, 1]],           # 18       | 从P4_fused_SE(层17)降维 | 128
   [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 19       | 上采样             | 128 (尺寸同P3)
   [[-1, 6], 1, Concat, [1]],            # 20       | concat(upsampled_P4_fused_SE, P3_SE from layer 6) | 128(P4_up) + 128(P3_SE) = 256
   [-1, 3, C3, [256, False]],            # 21       | FPN融合P4和P3后的C3处理 | 128 (P3_fused)
   # 在P3_fused之后加入SEBlock，这是第一个检测头的直接输入前驱
   [-1, 1, SEBlock, [128, 16]],         # 22       | P3_fused通道注意力  | 128 (P3_detect_in) <- 第1个检测头输入

  # --- PAN path (自底向上特征融合) ---
  # 从P3_fused (层21的输出, 未经过SE) 开始PAN路径，以保持与标准PAN的结构一致性，SE只在最终输出前。
  # 或者，也可以从P3_detect_in (层22的输出) 开始，让PAN也利用SE增强后的特征。这里我们选择前者。
  [21, 1, Conv, [256, 3, 2]],           # 23       | 从P3_fused(层21)下采样 | 128 (尺寸同P4)
                                          # 注意from索引是21，不是-1（上一层是SEBlock）
  # 与Neck中P4_fused_SE (层17的输出) 进行拼接
  [[-1, 17], 1, Concat, [1]],           # 24       | concat(downsampled_P3_fused, P4_fused_SE from layer 17) | 128 + 256 = 384
  [-1, 3, C3, [512, False]],            # 25       | PAN融合后的C3处理    | 256 (P4_aggregated)
  # 在P4_aggregated之后加入SEBlock，这是第二个检测头的直接输入前驱
  [-1, 1, SEBlock, [256, 16]],         # 26       | P4_aggregated通道注意力 | 256 (P4_detect_in) <- 第2个检测头输入

  # 从P4_aggregated (层25的输出, 未经过SE) 开始PAN路径
  [25, 1, Conv, [512, 3, 2]],           # 27       | 从P4_aggregated(层25)下采样 | 256 (尺寸同P5)
  # 与Neck中P5_neck_in (层13的输出)进行拼接
  [[-1, 13], 1, Concat, [1]],           # 28       | concat(downsampled_P4_aggregated, P5_neck_in from layer 13) | 256 + 256 = 512
  [-1, 3, C3, [1024, False]],           # 29       | PAN融合后的C3处理    | 512 (P5_aggregated)
  # 在P5_aggregated之后加入SEBlock，这是第三个检测头的直接输入前驱
  [-1, 1, SEBlock, [512, 16]],         # 30       | P5_aggregated通道注意力 | 512 (P5_detect_in) <- 第3个检测头输入

  # --- Detection Head ---
  # 输入来自Neck中三个经过SEBlock增强的特征图
  [[22, 26, 30], 1, Detect, [nc, anchors]], # 31       | 检测头，输入P3,P4,P5 |
]